{
  "iot": [
    {
      "id": 1,
      "title": "Real-Time IoT Imaging with Deep Neural Networks",
      "author": "Nicolas Modrzyk",
      "description": "An in-depth study of applying deep neural networks for real-time image processing and analysis in Internet of Things (IoT) systems.",
      "cover": "images/book2.jpg",
      "pages": 241,
      "publishedYear": 2023,
      "language": "English",
      "downloadLink": "https://drive.google.com/file/d/1lmMVYar75JC0oA_9gYicBcj17fj_3Uhs/view?usp=drive_link"
    },
    {
      "id": 2,
      "title": "Applied Learning Algorithms for Intelligent IoT",
      "author": "Pethuru Raj Chelliah, Usha Sakthivel, Susila Nagarajan",
      "description": "A comprehensive guide exploring how intelligent algorithms enhance data processing, decision-making, and automation in modern Internet of Things (IoT) applications.",
      "cover": "images/book1.jpg",
      "pages": 370,
      "publishedYear": 2023,
      "language": "English",
      "downloadLink": "https://drive.google.com/file/d/14mVpFApVXjAY61XqqN3DoFCGlhTEMSEY/view?usp=drive_link"
    },
    {
      "id": 3,
      "title": "IoT Sensor-Based Activity Recognition",
      "author": "Md Atiqur Rahman Ahad, Anindya Das Antar, Masud Ahmed",
      "description": "A detailed exploration of using IoT sensor data and machine learning techniques to recognize and analyze human activities in real time.",
      "cover": "images/book1.jpg",
      "pages": 214,
      "publishedYear": 2023,
      "language": "English",
      "downloadLink": "https://drive.google.com/file/d/1JKD5Ci7X_3yYwrecodF6NG-IAn-oOzi2/view?usp=drive_link"
    },
    {
      "id": 1767168461575,
      "title": "Beginning Azure IoT Edge Computing",
      "author": "David Jensen",
      "publishedYear": 2019,
      "pages": 273,
      "description": "About the Book This book demystifies edge computing by guiding developers through the Azure IoT Edge platform with practical, hands-on exercises to build and deploy intelligent solutions. It helps architects determine when to leverage the edge versus the cloud, covering essential patterns, container usage, and secure device provisioning. By the end, readers will understand how to extend cloud intelligence to edge devices effectively and securely.\n\nChapters List\n\nDo I Need an Intelligent Edge?\n\nAzure IoT Edge Core Concepts\n\nAzure IoT Edge Development Environment\n\nHello Edge\n\nDeveloping and Debugging Edge Modules\n\nAnalytics on the Edge\n\nDevice Provisioning Service\n\nAzure IoT Edge Security\n\nAzure DevOps for IoT Edge Solutions",
      "downloadLink": "https://drive.google.com/file/d/1HkhteuBS4az0eB8U_3Tf_DX9Utjixke4/view?usp=drive_link",
      "cover": "",
      "language": "English",
      "category": "iot"
    },
    {
      "id": 1767169173386,
      "title": "IoT Information Processing in an Increasingly Connected World",
      "author": "Leon Strous and Vinton G.1 Cerf2",
      "publishedYear": 2019,
      "pages": 243,
      "description": "This volume presents a comprehensive cross-domain perspective on IoT, addressing the technical challenges of architecture, interoperability, and data processing in a hyper-connected global network. It bridges the gap between hardware implementation and societal impact, exploring how vast amounts of data are securely managed and utilized across diverse industries. The text is essential for understanding the standardization efforts, security frameworks, and software middleware required to support the next generation of IoT ecosystems.\n\nChapters (Key Sections)\n\nHardware, Networks, and Data: Exploring the physical layer and connectivity standards.\n\nSoftware: Middleware, platforms, and architectural patterns.\n\nContext and Situation Awareness: How IoT systems perceive and react to environments.\n\nPrivacy and Security: Trust models, encryption, and data protection.\n\nUser-Centric IoT: Human-computer interaction and usability in smart systems.\n\nIoT Applications: Real-world case studies in healthcare, cities, and industry.",
      "downloadLink": "https://drive.google.com/file/d/12Qkozv4y2so086T5OruCCalvwfgAczLv/view?usp=drive_link",
      "cover": "",
      "language": "English",
      "category": "iot"
    },
    {
      "id": 1767169379434,
      "title": "Machine Learning, Big Data, and IoT for Medical Informatics",
      "author": "Dr. Pardeep Kumar ,Dr. Yugal Kumar ,Dr. Mohammad A. Tawhid",
      "publishedYear": 0,
      "pages": 434,
      "description": "This reference work explores the convergence of machine learning, big data analytics, and the Internet of Things to revolutionize modern healthcare systems and patient monitoring. It provides a comprehensive framework for processing the massive influx of medical data from wearable devices, focusing on real-time decision-making and predictive diagnostics. The text also addresses critical challenges such as data security, privacy protocols, and the deployment of intelligent algorithms in cloud-based medical environments.\n\nChapters List\n\nIntroduction to Internet of Things (IoT) in Healthcare\n\nBig Data Analytics for Intelligent Healthcare Management\n\nMachine Learning Algorithms for Medical Informatics\n\nDeep Learning for Medical Image Analysis\n\nSecurity and Privacy Issues in IoT-based Healthcare\n\nCloud and Fog Computing for Medical Data Processing\n\nWearable Sensors and Devices for Patient Monitoring\n\nBlockchain Technology for Electronic Health Records\n\nPredictive Analytics for Disease Diagnosis\n\nCase Studies in Smart Healthcare Systems",
      "downloadLink": "https://drive.google.com/file/d/1xH-0tHmzPRVnExzZqaup4r5Qu-J9E2qr/view?usp=drive_link",
      "cover": "",
      "language": "English",
      "category": "iot"
    },
    {
      "id": 1767169431937,
      "title": "The 5G operator",
      "author": "",
      "publishedYear": 0,
      "pages": 0,
      "description": ".",
      "downloadLink": "https://drive.google.com/file/d/1Vq3RzYLBc9QHDTqOX0AKFDGMVjpZUuQY/view?usp=drive_link",
      "cover": "",
      "language": "English",
      "category": "iot"
    },
    {
      "id": 1767169519198,
      "title": "Next Generation Internet of Things 2021-2027",
      "author": "",
      "publishedYear": 2019,
      "pages": 0,
      "description": "",
      "downloadLink": "https://drive.google.com/file/d/1ozfthT4H9MptlUg9_Nw52DguBEoAkY24/view?usp=drive_link",
      "cover": "",
      "language": "English",
      "category": "iot"
    },
    {
      "id": 1767170174953,
      "title": "Build Your Own IoT Platform",
      "author": "Anand Tamboli",
      "publishedYear": 2019,
      "pages": 228,
      "description": "This practical guide empowers developers to design and construct a custom Internet of Things platform from the ground up, bypassing costly commercial alternatives. It walks through the end-to-end architecture, from device connectivity and protocol selection to data storage and real-time visualization. Readers gain the technical know-how to integrate open-source tools into a scalable, secure, and fully controllable IoT ecosystem.\n\nChapters List\n\nIntroduction to IoT\n\nIoT Strategy\n\nThe IoT Platform\n\nConnectivity\n\nDevice Management\n\nData Management\n\nAnalytics\n\nUser Interface\n\nExternal Systems Integration\n\nSecurity\n\nIoT Project Execution",
      "downloadLink": "https://drive.google.com/file/d/1ebuRcrLUoIbdy6f3qnA6GSfboRx1OGeR/view?usp=drive_link",
      "cover": "",
      "language": "English",
      "category": "iot"
    },
    {
      "id": 1767170481360,
      "title": "IoT 2.0 and the INTERNET of TRANSFORMATION (Web of Things and Digital Twins)",
      "author": "Stefano Nativi, Alexander Kotsev",
      "publishedYear": 2020,
      "pages": 130,
      "description": "This report investigates the maturity and evolution of the Internet of Things (IoT) into \"IoT 2.0,\" emphasizing its role as a key engine for digital transformation.\nIt explores the shift from simple connectivity to intelligent, interoperable systems driven by the Web of Things (WoT) and Digital Twins. The text analyzes global data sources, including patents and scientific publications, to identify emerging trends, technical challenges, and the socio-economic impact of this technological convergence.   \n\nChapters (Key Sections)\n\nIntroduction and Methodology\n\nIoT Reference Framework   \n\nIoT (Communications) Protocols: Gateways Implementations\n\nSecurity Aspects\n\nIoT Platforms and Ecosystems\n\nConvergence Time: Addressing Interoperability Challenges (OCF, OneM2M, Mozilla IoT)\n\nThe W3C Web of Things (WoT) Initiative\n\nIoT 2.0, Digital Age, Local Data Ecosystems, and the Internet of Transformation\n\nIoT Landscape Analysis (Industry 4.0, Smart Home, Wearables)\n\nAnalysis of IoT Uptake: Emerging Trends",
      "downloadLink": "https://drive.google.com/file/d/1OgUWT26K9775n9sK0nAhUtBKCt7v6Hs1/view?usp=drive_link",
      "cover": "",
      "language": "English",
      "category": "iot"
    },
    {
      "id": 1767171241782,
      "title": "IoT Signals-Microsoft",
      "author": "",
      "publishedYear": 2019,
      "pages": 0,
      "description": "",
      "downloadLink": "https://drive.google.com/file/d/1Uehz9uwWDSt26lx7FUtSMwaf_XCXAEpi/view?usp=drive_link",
      "cover": "",
      "language": "English",
      "category": "iot"
    },
    {
      "id": 1767172023775,
      "title": "Internet of Things Landscape",
      "author": "cube LABS",
      "publishedYear": 2021,
      "pages": 95,
      "description": "This report provides a comprehensive overview of the Internet of Things (IoT) landscape, exploring its transformative impact across healthcare, manufacturing, agriculture, and retail industries in the wake of COVID-19. [cite_start]It analyzes key trends like 5G adoption and edge computing while offering strategic guidance on developing secure, scalable IoT solutions to drive digital transformation. [cite_start]The text serves as a practical guide for business leaders to navigate adoption challenges, from overcoming organizational inertia to implementing robust security frameworks.   \n\nChapters List\n\nThe COVID-19 Impact and Future\n\nTransforming Businesses with IoT (Overcoming Inertia)\n\nDeveloping IoT Solutions (From Problem Statement to LiveOps)\n\nThe IoT Universe (History and Market Statistics)\n\nInside the Internet of Things (Technology, Protocols, and Architecture)\n\nImpact Across Industries: Healthcare\n\nImpact Across Industries: Manufacturing (IIoT)\n\nImpact Across Industries: Agriculture\n\nImpact Across Industries: Retail\n\nIoT Security (Risks and Best Practices)",
      "downloadLink": "https://drive.google.com/file/d/1hOz2VKcFYTaJ6UIF76mMpdnzcGyKKDG0/view?usp=drive_link",
      "cover": "",
      "language": "English",
      "category": "iot"
    },
    {
      "id": 1767172736863,
      "title": "Multimedia Big Data Computing for IoT Applications",
      "author": "Sudeep Tanwar, Sudhanshu Tyagi, and Neeraj Kumar",
      "publishedYear": 2020,
      "pages": 477,
      "description": "This book serves as a \"how-to\" guide that addresses the practical, methodological, and moral questions related to handling the massive amounts of multimedia big data (MMBD) generated by IoT devices. It examines the unique nature and complexity of MMBD computing, covering research challenges such as scalability, accessibility, reliability, heterogeneity, and Quality of Service (QoS). The text is divided into four parts focusing on technological development, multimedia big data analytics, societal impacts, and application environments.",
      "downloadLink": "https://drive.google.com/file/d/1lKpXOxa3UjLxtlWC10S27XX_MC2SuViv/view?usp=drive_link",
      "cover": "",
      "language": "English",
      "category": "iot"
    },
    {
      "id": 1767173016907,
      "title": "IoT Development for ESP32 and ESP8266 with JavaScript",
      "author": "Peter Hoddie and Lizzie Prader",
      "publishedYear": 2020,
      "pages": 579,
      "description": "This book is a hands-on guide to building sophisticated IoT products on low-cost hardware like the ESP32 and ESP8266 using modern JavaScript. It serves as a bridge for developers, introducing embedded C/C++ programmers to JavaScript and web developers to the constraints of embedded systems. The text covers the Moddable SDK and the XS JavaScript engine, teaching readers how to handle networking, Bluetooth Low Energy (BLE), data storage, hardware sensors, audio, and rich graphical user interfaces on microcontrollers.\nChapter 1: Getting Started\n\nChapter 2: JavaScript for Embedded C and C++ Programmers\n\nChapter 3: Networking\n\nChapter 4: Bluetooth Low Energy (BLE)\n\nChapter 5: Files and Data\n\nChapter 6: Hardware\n\nChapter 7: Audio\n\nChapter 8: Graphics Fundamentals\n\nChapter 9: Drawing Graphics with Poco\n\nChapter 10: Building User Interfaces with Piu\n\nChapter 11: Adding Native Code",
      "downloadLink": "https://drive.google.com/file/d/1iiw6JpJTHkHhL22gvV5ThKcKzAMgT_0Z/view?usp=drive_link",
      "cover": "",
      "language": "English",
      "category": "iot"
    },
    {
      "id": 1767173236555,
      "title": "Raspberry Pi IoT Projects",
      "author": "John C. Shovic ,Danilo Bargen",
      "publishedYear": 2021,
      "pages": 284,
      "description": "Raspberry Pi IoT Projects is a practical, hands-on guide that demonstrates how to build real-world Internet of Things (IoT) applications using the Raspberry Pi. The book focuses on integrating sensors, cloud services, data visualization, and communication protocols to create scalable and functional IoT systems. It emphasizes project-based learning, making it suitable for students, hobbyists, and engineers who want to move from basic Raspberry Pi knowledge to complete IoT solutions",
      "downloadLink": "https://drive.google.com/file/d/1RoAVASbWURYpQLMr2LKtYvGu6IjHobPe/view?usp=drive_link",
      "cover": "",
      "language": "English",
      "category": "iot"
    },
    {
      "id": 1767173587990,
      "title": "Industrial IoT: Challenges, Design Principles, Applications, and Security",
      "author": "Ismail Butun",
      "publishedYear": 2020,
      "pages": 249,
      "description": "Industrial IoT: Challenges, Design Principles, Applications, and Security provides a comprehensive overview of Industrial Internet of Things (IIoT) systems, focusing on both theoretical foundations and real-world industrial applications. The book covers architectural design principles, communication technologies, data management, and security challenges specific to industrial environments. It brings together contributions from multiple experts, making it a valuable reference for researchers, graduate students, and engineers working in smart manufacturing, automation, and cyber-physical systems.\nIntroduction to Industrial IoT – ~24 pages\n\nIIoT Architectures and Design Principles – ~28 pages\n\nCommunication Technologies for Industrial IoT – ~32 pages\n\nEdge and Cloud Computing in IIoT – ~26 pages\n\nData Analytics and Machine Learning for IIoT – ~30 pages\n\nIndustrial IoT Applications and Use Cases – ~34 pages\n\nSecurity and Privacy Challenges in IIoT – ~36 pages\n\nBlockchain and Trust Management in IIoT – ~24 pages\n\nFuture Trends and Research Directions – ~20 pages",
      "downloadLink": "https://drive.google.com/file/d/1fwuEaY3OcmMu-vyBGpdjnKh3xVNWuQwW/view?usp=drive_link",
      "cover": "",
      "language": "English",
      "category": "iot"
    },
    {
      "id": 1767174006042,
      "title": "Leveraging Industrial IoT and advanced technologies for digital transformation",
      "author": "Andreas Behrendt  Enno de Boer  Tarek Kasah  Bodo Koerber  Niko Mohr  Gérard Richter",
      "publishedYear": 0,
      "pages": 250,
      "description": "This book explores how Industrial Internet of Things (IIoT) and advanced digital technologies can be systematically leveraged to drive large-scale digital transformation in industrial enterprises. Rather than focusing solely on technology, the authors emphasize the alignment of business strategy, organizational structure, and technological capabilities to achieve sustainable value creation. Drawing on real industrial case studies, the book provides practical frameworks, operating models, and governance principles that help organizations move from isolated pilot projects to scalable, enterprise-wide digital solutions\nIntroduction to Industrial IoT–Driven Digital Transformation\n\nThe Business Value of Industrial IoT\n\nAligning Business Strategy with Digital Capabilities\n\nOrganizational Change and Operating Models\n\nIIoT Architecture and Technology Foundations\n\nAdvanced Technologies Enabling IIoT\n\nScaling Digital Solutions Across the Enterprise\n\nCybersecurity and Risk Management in IIoT\n\nCase Studies from Industrial Leaders\n\nRoadmap for Capturing Value at Scale",
      "downloadLink": "https://drive.google.com/file/d/1EFes8enGlOOVdwrY4eDRUJ8IW2AaKCl6/view?usp=drive_link",
      "cover": "",
      "language": "English",
      "category": "iot"
    },
    {
      "id": 1767174245292,
      "title": "Smart Technologies for Energy and Environmental Sustainability",
      "author": "Parul Agarwal  Mamta Mittal  Jawed Ahmed  Sheikh Mohammad Idrees",
      "publishedYear": 2021,
      "pages": 0,
      "description": "Smart Technologies for Energy and Environmental Sustainability explores the role of intelligent and emerging technologies in addressing modern energy challenges and environmental sustainability. The book presents interdisciplinary research covering smart grids, renewable energy systems, energy-efficient computing, environmental monitoring, and sustainable development. By combining theoretical frameworks with practical case studies, it provides valuable insights for researchers, graduate students, and professionals working in energy systems, environmental engineering, and smart infrastructure.\nIntroduction to Smart Energy and Environmental Sustainability\n\nSmart Grid Technologies and Applications\n\nRenewable Energy Integration and Management\n\nInternet of Things for Energy Monitoring\n\nMachine Learning and AI in Sustainable Energy Systems\n\nSmart Cities and Sustainable Infrastructure\n\nEnvironmental Monitoring Using Smart Sensors\n\nEnergy-Efficient Computing and Green Technologies\n\nSecurity and Privacy in Smart Energy Systems\n\nFuture Trends in Energy and Environmental Sustainability",
      "downloadLink": "https://drive.google.com/file/d/1zQWG5yocdBli4nzwyB04KzBQNQCLI46P/view?usp=drive_link",
      "cover": "",
      "language": "English",
      "category": "iot"
    },
    {
      "id": 1767175251109,
      "title": "IoT and IoE Driven Smart Cities",
      "author": "Samarendra Nath Sur, Valentina Emilia Balas, Akash Kumar Bhoi, Anand Nayyar",
      "publishedYear": 2021,
      "pages": 324,
      "description": "This book provides a detailed technical exploration of applying the Internet of Things (IoT) and the Internet of Everything (IoE) within smart city environments. It focuses heavily on the design aspects related to physical and network layer models.\n\nThe text explores utilizing advanced communication technologies—such as Multi-Input Multi-Output (MIMO), Narrow-Band IoT (NB-IoT), Ultra-Reliable Low Latency Communications (URLLC), Enhanced Mobile Broadband (eMBB), and Massive Machine-Type Communications (mMTC)—to successfully implement IoT and IoE infrastructures. It also addresses the role of cloud computing and analyzes challenges and future predictions for smart city development.\nChapter 1: A Comprehensive Review on Physical Layer Design for Smart Cities\n\nChapter 2: An Overview of Security and Privacy in Smart Cities\n\nChapter 3: Design of Multiple Access Network by Enabling User Grouping and Energy Harvesting in Relaying System for Smart Cities\n\nAdditional Key Topics Covered:\n\nSmart Sensors and Actuators for IoE-based Smart Cities\n\nMachine Learning and Deep Learning Algorithms for Smart Cities\n\nIntelligent Transportation Systems (ITS) and Traffic Management\n\nEnergy Harvesting (EH) and Cooperative Non-Orthogonal Multiple Access (NOMA)\n\nCloud Computing advancements for IoT/IoE support",
      "downloadLink": "https://drive.google.com/file/d/1IMx2Zff1bz0VlofRm-D60-cQsoc9RfXl/view?usp=drive_link",
      "cover": "",
      "language": "English",
      "category": "iot"
    },
    {
      "id": 1767175799430,
      "title": "The Internet of Things: Catching up to an accelerating opportunity",
      "author": "McKinsey Global Institute (Michael Chui, Mark Collins, Mark Patel)",
      "publishedYear": 2021,
      "pages": 80,
      "description": "This influential industry report serves as a major update to McKinsey's 2015 analysis (The Internet of Things: Mapping the Value Beyond the Hype). It evaluates how the IoT market has evolved compared to initial predictions and provides a forecasted economic outlook through 2030.\n\nThe central thesis is that while IoT growth was initially slower than predicted due to \"headwinds\" (such as installation costs, cybersecurity issues, and change management), the potential economic value remains massive. The report estimates that by 2030, IoT could enable $5.5 trillion to $12.6 trillion in value globally. It breaks down this opportunity across specific physical settings (like factories, cities, and homes) and advises business leaders on how to scale their IoT pilots into full deployments.\nIntroduction: Review of the 2015 predictions vs. the 2020 reality.\n\nThe Nine Settings (Analysis by Environment):\n\nFactory: Operations management and predictive maintenance (The largest value pool).\n\nHuman Health: Monitoring and managing illness (e.g., glucose monitoring, heart trackers).\n\nHome: Home automation and security.\n\nCity: Public health, traffic control, and resource management.\n\nRetail: Checkout automation and inventory optimization.\n\nOutside: Logistics routing and autonomous vehicles.\n\nWorksites: Operations management in mining, construction, etc.\n\nVehicles: Condition-based maintenance and usage-based insurance.\n\nOffices: Energy management and security.",
      "downloadLink": "https://drive.google.com/file/d/1jMVkLFR-7xVjpTQTlTdSsR-Zp3_qRD5b/view?usp=drive_link",
      "cover": "",
      "language": "English",
      "category": "iot"
    },
    {
      "id": 1767180882565,
      "title": "IoT Signals Manufacturing Spotlight",
      "author": "Microsoft, Intel",
      "publishedYear": 2022,
      "pages": 55,
      "description": "This report, a collaboration between Microsoft, Intel, and IoT Analytics, examines the current and future state of IoT technology in the manufacturing industry. It focuses on how manufacturers are leveraging Smart Factory operations and Smart Products to drive digital transformation.\n\nThe insights are based on a survey of 500 decision-makers in discrete, hybrid, and process manufacturing across North America, Europe, and Asia-Pacific. [cite_start]The report highlights key trends such as the acceleration of digital transformation post-COVID-19, the shift of investments toward industrial automation, and the rising importance of sustainability and workforce enablement.",
      "downloadLink": "https://drive.google.com/file/d/1lEeBQ-L2xuw5F-W7QWlEoUraf4-mcim-/view?usp=drive_link",
      "cover": "",
      "language": "English",
      "category": "iot"
    },
    {
      "id": 1767180977526,
      "title": "Blockchain  Principles and Applications in IoT",
      "author": "Rajdeep Chakraborty, Anupam Ghosh, Valentina Emilia Balas, Ahmed A. Elngar",
      "publishedYear": 2023,
      "pages": 0,
      "description": "This book is a comprehensive guide to Blockchain technology and its integration with the Internet of Things (IoT). It is designed as a resource for graduates, researchers, and professionals in computer science and IT.\n\nThe text covers the fundamental principles of blockchain, tracing its history from cryptocurrencies to broader industrial applications. It focuses on how blockchain can serve as a secure, decentralized data repository for IoT devices, addressing critical challenges like scalability, security, and privacy. The book also goes beyond financial use cases to explore applications in healthcare, supply chain management, and smart cities.\n\nChapters & Topics\nThe book is organized into three main sections:\n\nSection A: Blockchain Principles\nAn Overview of Blockchain as a Security Tool in the Internet of Things\n\nThe Study of Consensus Algorithms in Blockchain\n\nSmart Contracts: The Self-Executing Contracts\n\nIntroduction to Internet of Things with Flavor of Blockchain Technology\n\nBlockchain Implementation Challenges for IoT\n\nIoT Benchmark in Industry 5.0\n\nSection B: Blockchain Applications in Internet of Things (IoT)\nASIC-Based Mining System in Blockchain for IoT Environment to Increase Scalability and Security\n\nUsage of Blockchain with Machine Learning for Patient Record Management and Analysis Purposes\n\nIoT-Based Electronic Health Records (EHR) Management System Using Blockchain Technology\n\nApplications of Blockchain Technology to Emerging Educational Scenario: International Context and Indian Potentialities\n\nSection C: Security Aspects in Blockchain and IoT\nCryptographic and Consensus Techniques Supporting Privacy and Security Management of Cryptocurrency Transactions\n\nSecured Blockchain-based Database for Storing Sensitive Information for Access Control IoT Systems\n\nCryptographic Foundations of Blockchain Technology\n\nAccess Control and Data Security of IoT Applications using Blockchain Technology\n\nLightweight Cryptography and Protocols for IoT Security",
      "downloadLink": "https://drive.google.com/file/d/1okUy4ziq-ovcYThlQ_uY8YfY7VTCYxmI/view?usp=drive_link",
      "cover": "",
      "language": "English",
      "category": "iot"
    },
    {
      "id": 1767221489776,
      "title": "internet of Things and the Law",
      "author": "Guido Noto La Diega",
      "publishedYear": 2023,
      "pages": 360,
      "description": "The book presents a comprehensive analysis of the legal issues surrounding the Internet of Things (IoT). It explores the shift from dematerialisation (digital/intangible wealth) back to \"rematerialisation\" (the return of data and power to the physical world). The central question addressed is whether the law can steer this development in a human-centric and socially just direction. [cite_start]It analyzes how existing laws—such as privacy, intellectual property, telecommunications, and competition laws—can empower IoT end-users, while also proposing a \"utopian horizon\" for IoT governance based on political economy and social theory.",
      "downloadLink": "https://drive.google.com/file/d/1WC4tsxeXT2-2Nj1YPwiKf1gGyvPspyXO/view?usp=drive_link",
      "cover": "",
      "language": "English",
      "category": "iot"
    },
    {
      "id": 1767221990490,
      "title": "TinyML Cookbook",
      "author": "Gian Marco Iodice",
      "publishedYear": 2022,
      "pages": 320,
      "description": "his book serves as a practical guide to TinyML, a field combining machine learning with ultra-low-power embedded devices. It is structured as a cookbook with \"recipes\" for building end-to-end applications on the Arduino Nano 33 BLE Sense and Raspberry Pi Pico. [cite_start]The book covers a range of projects from basic prototyping to advanced use cases like voice control, gesture recognition, and image classification, and introduces concepts like microNPU (Neural Processing Unit) for next-generation edge computing.\nChapter 1: Getting Started with TinyML\n\nChapter 2: Prototyping with Microcontrollers\n\nChapter 3: Building a Weather Station with TensorFlow Lite for Microcontrollers\n\nChapter 4: Voice Controlling LEDs with Edge Impulse\n\nChapter 5: Indoor Scene Classification with TensorFlow Lite for Microcontrollers and the Arduino Nano\n\nChapter 6: Building a Gesture-Based Interface for YouTube Playback\n\nChapter 7: Running a Tiny CIFAR-10 Model on a Virtual Platform with the Zephyr OS\n\nChapter 8: Toward the Next TinyML Generation with microNPU",
      "downloadLink": "https://drive.google.com/file/d/1Lhjq3Q-du_wZbWEZC8lvdifvCW7Rw2vW/view?usp=drive_link",
      "cover": "",
      "language": "English",
      "category": "iot"
    }
  ],
  "programming": [
    {
      "id": 1767171584029,
      "title": "Blockchain and Crypto Currency",
      "author": "Makoto Yano, Chris Dai, Kenichi Masuda, Yoshio Kishimoto",
      "publishedYear": 2020,
      "pages": 150,
      "description": "This open-access book explores how blockchain technology can create a \"high quality\" marketplace for data, treating data as a new production factor similar to capital or labor. It applies economic theory to the technical architecture of blockchain, proposing ways to ensure data reliability, security, and proper valuation in a decentralized ecosystem. The text bridges the gap between engineering and economics, discussing how to prevent data monopolies while enabling secure IoT and big data applications.\n\nChapters List\n\nCreation of Blockchain and a New Ecosystem\n\nMarket Quality Approach to IoT Data on Blockchain Big Data\n\nIndustrial Applications of Blockchain to IoT Data\n\nTheory of Money: From Ancient Japanese Copper Coins to Virtual Currencies\n\nEthereum, Smart Contracts, DApps\n\nDEX: A DApp for the Decentralized Marketplace\n\nBlockchain Business and Its Regulation\n\nBitcoin and Blockchain Technology",
      "downloadLink": "https://drive.google.com/file/d/10P2WJ_d4VxCXvTjFe0io7wJ5Mt5xgMDE/view?usp=drive_link",
      "cover": "",
      "language": "English",
      "category": "programming"
    }
  ],
  "ai": [
    {
      "id": 1767174376646,
      "title": "AI-Enabled Threat Detection and Security Analysis for Industrial IoT",
      "author": "Hadis Karimipour ,Farnaz Derakhshan",
      "publishedYear": 2023,
      "pages": 250,
      "description": "AI-Enabled Threat Detection and Security Analysis for Industrial IoT focuses on the application of artificial intelligence and machine learning techniques to enhance security in Industrial Internet of Things (IIoT) environments. The book addresses modern cyber threats targeting industrial systems and presents intelligent methods for intrusion detection, anomaly detection, malware analysis, and risk mitigation. It combines theoretical foundations with practical industrial use cases, making it a valuable reference for researchers, cybersecurity professionals, and engineers working with smart manufacturing and critical infrastructure systems.\nIntroduction to Industrial IoT Security\n\nThreat Landscape in Industrial IoT Systems\n\nAI and Machine Learning Fundamentals for Cybersecurity\n\nIntrusion Detection Systems for IIoT\n\nAnomaly Detection Using Deep Learning\n\nMalware Detection and Classification in IIoT\n\nNetwork Traffic Analysis for Industrial Systems\n\nSecure Architectures for AI-Enabled IIoT\n\nCase Studies in Industrial Cybersecurity\n\nChallenges, Limitations, and Ethical Considerations\n\nFuture Directions in AI-Based IIoT Security",
      "downloadLink": "https://drive.google.com/file/d/13o0tFehw_D2y-KNMvxLSb42EVX0tGD0u/view?usp=drive_link",
      "cover": "",
      "language": "English",
      "category": "ai"
    },
    {
      "id": 1767180781077,
      "title": "Artificial Intelligence, Blockchain and IoT for Smart Healthcare",
      "author": "Hitesh Kumar Sharma, Anuj Kumar, Sangeeta Pant, Mangey Ram",
      "publishedYear": 0,
      "pages": 0,
      "description": "This book presents a cross-disciplinary perspective on how Artificial Intelligence (AI), the Internet of Things (IoT), and Blockchain are converging to transform traditional healthcare into a smart, remote-accessible system.\n\nIt is heavily motivated by the shift in healthcare delivery seen during the COVID-19 pandemic, focusing on telemedicine and e-healthcare. The text explains how IoT sensors collect patient data, AI analyzes it for diagnosis, and Blockchain ensures the security and privacy of that sensitive medical information (Electronic Health Records). It is designed to be accessible to both beginners and advanced researchers, bridging the gap between medical staff and technology professionals\nntroduction to Smart Healthcare and Telemedicine Systems: Overview of the shift from traditional to smart healthcare and the challenges involved.\n\nAdvanced Technologies Involved in Smart Healthcare and Telemedicine Systems: A look at the specific tech stack driving the industry.\n\nRole of Artificial Intelligence, IoT and Blockchain in Smart Healthcare: How these three pillars interact within a single ecosystem.\n\nApplication of Artificial Intelligence in Smart Healthcare: Use cases for AI in diagnosis and patient management.\n\nApplication of IoT in Smart Healthcare: Focus on sensors, wearables, and remote monitoring tools.\n\nApplication of Blockchain in Smart Healthcare: Securing transactions and patient data ledgers.\n\nSecurity and Privacy Challenge in Smart Healthcare and Telemedicine Systems: Addressing user authentication and data breaches.\n\nElectronic Healthcare Record (EHR) Storage using Blockchain for Smart Healthcare: A specific framework for managing digital health records securely.",
      "downloadLink": "https://drive.google.com/file/d/1los2HZODZhSeRa4mi8ETOai8ydZKXmVp/view?usp=drive_link",
      "cover": "",
      "language": "English",
      "category": "ai"
    }
  ],
  "electronics": [],
  "networking": [],
  "security": []
}